[
    {
      "title": "Ultimate Step-by-Step Guide to Building a RAG Chatbot from Scratch",
      "slug": "ultimate-step-by-step-guide-rag-chatbot",
      "description": "Learn how to build a powerful Retrieval-Augmented Generation (RAG) chatbot from scratch with our step-by-step guide, using Python, FAISS, and the OpenAI API.",
      "author": "Muhammad Umer Bhutta",
      "date": "2025-05-07",
      "image": "/blog_image_1.png"
    },
    {
      "title": "Prompt Engineering 101: Best Practices for Crafting Effective Queries",
      "slug": "prompt-engineering-101",
      "description": "Master prompt engineering for GPT-4, LLaMA 3, and Gemma with practical techniques—from zero-shot and few-shot to chain-of-thought and role-based prompting—illustrated with examples and visual guides.",
      "author": "Muhammad Umer Bhutta",
      "date": "2025-05-07",
      "image": "/prompt-engineering-101.png"
    },
    {
      "title": "Fine-Tuning vs. In-Context Learning: Customizing LLMs for Your Workflow",
      "slug": "fine-tuning-vs-in-context",
      "description": "Compare approaches for tailoring models to your domain—including full fine-tuning, parameter-efficient tuning (LoRA), and prompt-based methods—with real healthcare use cases and practical trade-offs.",
      "author": "Muhammad Umer Bhutta",
      "date": "2025-05-07",
      "image": "/fine-tuning-vs-in-context.png"
    },
    {
    "title": "Introduction to LangChain: Building Blocks for LLM Applications",
    "slug": "introduction-to-langchain-llm-applications",
    "description": "Learn LangChain's essential building blocks like chains, prompt templates, and memory, and build a conversational RAG system using Python, Hugging Face, and open-source LLMs like Llama 3.",
    "author": "Muhammad Umer Bhutta",
    "date": "2025-05-24",
    "image": "/langchain-intro.png"
    },
    {
    "title": "LangGraph 101: Building Stateful AI Workflows in Python",
    "slug": "langgraph-101-building-stateful-ai-workflows-in-python",
    "description": "A beginner-friendly guide to LangGraph, covering Python building blocks, core concepts like state, nodes, edges, conditional logic, tools, and messages for building stateful AI agent workflows on top of LangChain.",
    "author": "Muhammad Umer Bhutta",
    "date": "2025-06-11",
    "image": "/langgraph-101.png"
    }
  ]
  